RT-Thread/rt-thread/bsp/nuvoton/libraries/m031/Device/Nuvoton/M031/Include/uspi_reg.h
#define USPI_BUFCTL_RXRST_Pos         (17)                                           /*!< USPI_T::BUFCTL: RXRST Position      */
#define USPI_BUFCTL_RXRST_Msk         (0x1ul << USPI_BUFCTL_RXRST_Pos)               /*!< USPI_T::BUFCTL: RXRST Mask          */

#define USPI_BUFSTS_RXEMPTY_Pos       (0)                                            /*!< USPI_T::BUFSTS: RXEMPTY Position    */
#define USPI_BUFSTS_RXEMPTY_Msk       (0x1ul << USPI_BUFSTS_RXEMPTY_Pos)             /*!< USPI_T::BUFSTS: RXEMPTY Mask        */

#define USPI_BUFSTS_RXFULL_Pos        (1)                                            /*!< USPI_T::BUFSTS: RXFULL Position     */
#define USPI_BUFSTS_RXFULL_Msk        (0x1ul << USPI_BUFSTS_RXFULL_Pos)              /*!< USPI_T::BUFSTS: RXFULL Mask         */

#define USPI_BUFSTS_RXOVIF_Pos        (3)                                            /*!< USPI_T::BUFSTS: RXOVIF Position     */
#define USPI_BUFSTS_RXOVIF_Msk        (0x1ul << USPI_BUFSTS_RXOVIF_Pos)              /*!< USPI_T::BUFSTS: RXOVIF Mask         */

#define USPI_BUFSTS_TXEMPTY_Pos       (8)                                            /*!< USPI_T::BUFSTS: TXEMPTY Position    */
#define USPI_BUFSTS_TXEMPTY_Msk       (0x1ul << USPI_BUFSTS_TXEMPTY_Pos)             /*!< USPI_T::BUFSTS: TXEMPTY Mask        */

#define USPI_BUFSTS_TXFULL_Pos        (9)                                            /*!< USPI_T::BUFSTS: TXFULL Position     */
#define USPI_BUFSTS_TXFULL_Msk        (0x1ul << USPI_BUFSTS_TXFULL_Pos)              /*!< USPI_T::BUFSTS: TXFULL Mask         */

#define USPI_BUFSTS_TXUDRIF_Pos       (11)                                           /*!< USPI_T::BUFSTS: TXUDRIF Position    */
#define USPI_BUFSTS_TXUDRIF_Msk       (0x1ul << USPI_BUFSTS_TXUDRIF_Pos)             /*!< USPI_T::BUFSTS: TXUDRIF Mask        */

#define USPI_PDMACTL_PDMARST_Pos      (0)                                            /*!< USPI_T::PDMACTL: PDMARST Position   */
#define USPI_PDMACTL_PDMARST_Msk      (0x1ul << USPI_PDMACTL_PDMARST_Pos)            /*!< USPI_T::PDMACTL: PDMARST Mask       */

#define USPI_PDMACTL_TXPDMAEN_Pos     (1)                                            /*!< USPI_T::PDMACTL: TXPDMAEN Position  */
#define USPI_PDMACTL_TXPDMAEN_Msk     (0x1ul << USPI_PDMACTL_TXPDMAEN_Pos)           /*!< USPI_T::PDMACTL: TXPDMAEN Mask      */

#define USPI_PDMACTL_RXPDMAEN_Pos     (2)                                            /*!< USPI_T::PDMACTL: RXPDMAEN Position  */
#define USPI_PDMACTL_RXPDMAEN_Msk     (0x1ul << USPI_PDMACTL_RXPDMAEN_Pos)           /*!< USPI_T::PDMACTL: RXPDMAEN Mask      */

#define USPI_PDMACTL_PDMAEN_Pos       (3)                                            /*!< USPI_T::PDMACTL: PDMAEN Position    */
#define USPI_PDMACTL_PDMAEN_Msk       (0x1ul << USPI_PDMACTL_PDMAEN_Pos)             /*!< USPI_T::PDMACTL: PDMAEN Mask        */

#define USPI_WKCTL_WKEN_Pos           (0)                                            /*!< USPI_T::WKCTL: WKEN Position        */
#define USPI_WKCTL_WKEN_Msk           (0x1ul << USPI_WKCTL_WKEN_Pos)                 /*!< USPI_T::WKCTL: WKEN Mask            */

#define USPI_WKCTL_PDBOPT_Pos         (2)                                            /*!< USPI_T::WKCTL: PDBOPT Position      */
#define USPI_WKCTL_PDBOPT_Msk         (0x1ul << USPI_WKCTL_PDBOPT_Pos)               /*!< USPI_T::WKCTL: PDBOPT Mask          */

#define USPI_WKSTS_WKF_Pos            (0)                                            /*!< USPI_T::WKSTS: WKF Position         */
#define USPI_WKSTS_WKF_Msk            (0x1ul << USPI_WKSTS_WKF_Pos)                  /*!< USPI_T::WKSTS: WKF Mask             */

#define USPI_PROTCTL_SLAVE_Pos        (0)                                            /*!< USPI_T::PROTCTL: SLAVE Position     */
#define USPI_PROTCTL_SLAVE_Msk        (0x1ul << USPI_PROTCTL_SLAVE_Pos)              /*!< USPI_T::PROTCTL: SLAVE Mask         */

#define USPI_PROTCTL_SLV3WIRE_Pos     (1)                                            /*!< USPI_T::PROTCTL: SLV3WIRE Position  */
#define USPI_PROTCTL_SLV3WIRE_Msk     (0x1ul << USPI_PROTCTL_SLV3WIRE_Pos)           /*!< USPI_T::PROTCTL: SLV3WIRE Mask      */

#define USPI_PROTCTL_SS_Pos           (2)                                            /*!< USPI_T::PROTCTL: SS Position        */
#define USPI_PROTCTL_SS_Msk           (0x1ul << USPI_PROTCTL_SS_Pos)                 /*!< USPI_T::PROTCTL: SS Mask            */

#define USPI_PROTCTL_AUTOSS_Pos       (3)                                            /*!< USPI_T::PROTCTL: AUTOSS Position    */
#define USPI_PROTCTL_AUTOSS_Msk       (0x1ul << USPI_PROTCTL_AUTOSS_Pos)             /*!< USPI_T::PROTCTL: AUTOSS Mask        */

#define USPI_PROTCTL_SCLKMODE_Pos     (6)                                            /*!< USPI_T::PROTCTL: SCLKMODE Position  */
#define USPI_PROTCTL_SCLKMODE_Msk     (0x3ul << USPI_PROTCTL_SCLKMODE_Pos)           /*!< USPI_T::PROTCTL: SCLKMODE Mask      */

#define USPI_PROTCTL_SUSPITV_Pos      (8)                                            /*!< USPI_T::PROTCTL: SUSPITV Position   */
#define USPI_PROTCTL_SUSPITV_Msk      (0xful << USPI_PROTCTL_SUSPITV_Pos)            /*!< USPI_T::PROTCTL: SUSPITV Mask       */

#define USPI_PROTCTL_TSMSEL_Pos       (12)                                           /*!< USPI_T::PROTCTL: TSMSEL Position    */
#define USPI_PROTCTL_TSMSEL_Msk       (0x7ul << USPI_PROTCTL_TSMSEL_Pos)             /*!< USPI_T::PROTCTL: TSMSEL Mask        */

#define USPI_PROTCTL_SLVTOCNT_Pos     (16)                                           /*!< USPI_T::PROTCTL: SLVTOCNT Position  */
#define USPI_PROTCTL_SLVTOCNT_Msk     (0x3fful << USPI_PROTCTL_SLVTOCNT_Pos)         /*!< USPI_T::PROTCTL: SLVTOCNT Mask      */

#define USPI_PROTCTL_TXUDRPOL_Pos     (28)                                           /*!< USPI_T::PROTCTL: TXUDRPOL Position  */
#define USPI_PROTCTL_TXUDRPOL_Msk     (0x1ul << USPI_PROTCTL_TXUDRPOL_Pos)           /*!< USPI_T::PROTCTL: TXUDRPOL Mask      */

#define USPI_PROTCTL_PROTEN_Pos       (31)                                           /*!< USPI_T::PROTCTL: PROTEN Position    */
#define USPI_PROTCTL_PROTEN_Msk       (0x1ul << USPI_PROTCTL_PROTEN_Pos)             /*!< USPI_T::PROTCTL: PROTEN Mask        */

