RT-Thread/rt-thread/bsp/nuvoton/libraries/m031/Device/Nuvoton/M031/Include/uspi_reg.h
#define USPI_PROTIEN_SSINAIEN_Pos     (0)                                            /*!< USPI_T::PROTIEN: SSINAIEN Position  */
#define USPI_PROTIEN_SSINAIEN_Msk     (0x1ul << USPI_PROTIEN_SSINAIEN_Pos)           /*!< USPI_T::PROTIEN: SSINAIEN Mask      */

#define USPI_PROTIEN_SSACTIEN_Pos     (1)                                            /*!< USPI_T::PROTIEN: SSACTIEN Position  */
#define USPI_PROTIEN_SSACTIEN_Msk     (0x1ul << USPI_PROTIEN_SSACTIEN_Pos)           /*!< USPI_T::PROTIEN: SSACTIEN Mask      */

#define USPI_PROTIEN_SLVTOIEN_Pos     (2)                                            /*!< USPI_T::PROTIEN: SLVTOIEN Position  */
#define USPI_PROTIEN_SLVTOIEN_Msk     (0x1ul << USPI_PROTIEN_SLVTOIEN_Pos)           /*!< USPI_T::PROTIEN: SLVTOIEN Mask      */

#define USPI_PROTIEN_SLVBEIEN_Pos     (3)                                            /*!< USPI_T::PROTIEN: SLVBEIEN Position  */
#define USPI_PROTIEN_SLVBEIEN_Msk     (0x1ul << USPI_PROTIEN_SLVBEIEN_Pos)           /*!< USPI_T::PROTIEN: SLVBEIEN Mask      */

#define USPI_PROTSTS_TXSTIF_Pos       (1)                                            /*!< USPI_T::PROTSTS: TXSTIF Position    */
#define USPI_PROTSTS_TXSTIF_Msk       (0x1ul << USPI_PROTSTS_TXSTIF_Pos)             /*!< USPI_T::PROTSTS: TXSTIF Mask        */

#define USPI_PROTSTS_TXENDIF_Pos      (2)                                            /*!< USPI_T::PROTSTS: TXENDIF Position   */
#define USPI_PROTSTS_TXENDIF_Msk      (0x1ul << USPI_PROTSTS_TXENDIF_Pos)            /*!< USPI_T::PROTSTS: TXENDIF Mask       */

#define USPI_PROTSTS_RXSTIF_Pos       (3)                                            /*!< USPI_T::PROTSTS: RXSTIF Position    */
#define USPI_PROTSTS_RXSTIF_Msk       (0x1ul << USPI_PROTSTS_RXSTIF_Pos)             /*!< USPI_T::PROTSTS: RXSTIF Mask        */

#define USPI_PROTSTS_RXENDIF_Pos      (4)                                            /*!< USPI_T::PROTSTS: RXENDIF Position   */
#define USPI_PROTSTS_RXENDIF_Msk      (0x1ul << USPI_PROTSTS_RXENDIF_Pos)            /*!< USPI_T::PROTSTS: RXENDIF Mask       */

#define USPI_PROTSTS_SLVTOIF_Pos      (5)                                            /*!< USPI_T::PROTSTS: SLVTOIF Position   */
#define USPI_PROTSTS_SLVTOIF_Msk      (0x1ul << USPI_PROTSTS_SLVTOIF_Pos)            /*!< USPI_T::PROTSTS: SLVTOIF Mask       */

#define USPI_PROTSTS_SLVBEIF_Pos      (6)                                            /*!< USPI_T::PROTSTS: SLVBEIF Position   */
#define USPI_PROTSTS_SLVBEIF_Msk      (0x1ul << USPI_PROTSTS_SLVBEIF_Pos)            /*!< USPI_T::PROTSTS: SLVBEIF Mask       */

#define USPI_PROTSTS_SSINAIF_Pos      (8)                                            /*!< USPI_T::PROTSTS: SSINAIF Position   */
#define USPI_PROTSTS_SSINAIF_Msk      (0x1ul << USPI_PROTSTS_SSINAIF_Pos)            /*!< USPI_T::PROTSTS: SSINAIF Mask       */

#define USPI_PROTSTS_SSACTIF_Pos      (9)                                            /*!< USPI_T::PROTSTS: SSACTIF Position   */
#define USPI_PROTSTS_SSACTIF_Msk      (0x1ul << USPI_PROTSTS_SSACTIF_Pos)            /*!< USPI_T::PROTSTS: SSACTIF Mask       */

#define USPI_PROTSTS_SSLINE_Pos       (16)                                           /*!< USPI_T::PROTSTS: SSLINE Position    */
#define USPI_PROTSTS_SSLINE_Msk       (0x1ul << USPI_PROTSTS_SSLINE_Pos)             /*!< USPI_T::PROTSTS: SSLINE Mask        */

#define USPI_PROTSTS_BUSY_Pos         (17)                                           /*!< USPI_T::PROTSTS: BUSY Position      */
#define USPI_PROTSTS_BUSY_Msk         (0x1ul << USPI_PROTSTS_BUSY_Pos)               /*!< USPI_T::PROTSTS: BUSY Mask          */

#define USPI_PROTSTS_SLVUDR_Pos       (18)                                           /*!< USPI_T::PROTSTS: SLVUDR Position    */
#define USPI_PROTSTS_SLVUDR_Msk       (0x1ul << USPI_PROTSTS_SLVUDR_Pos)             /*!< USPI_T::PROTSTS: SLVUDR Mask        */

/**@}*/ /* USPI_CONST */
/**@}*/ /* end of USPI register group */


/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __USPI_REG_H__ */
